src/cf/Enums/GDS_СостоянияПроверкиАПП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>GDS_СостоянияПроверкиАПП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Исправно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неисправно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отсутствует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вналичии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Просрочено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/GDS_СостоянияПроверкиАПП/Ext/ManagerModule.bsl
Функция ЗначениеИзСтроки(НаименованиеСтатуса) Экспорт
	Если СтрСравнить(НаименованиеСтатуса, "Исправно") = 0 Тогда
		Возврат Исправно;
	ИначеЕсли СтрСравнить(НаименованиеСтатуса, "Неисправно") = 0 Тогда
		Возврат Неисправно;
	ИначеЕсли СтрСравнить(НаименованиеСтатуса, "Отсутствует") = 0 Тогда
		Возврат Отсутствует;
	ИначеЕсли СтрСравнить(НаименованиеСтатуса, "В наличии") = 0 Тогда
		Возврат Вналичии;
	ИначеЕсли СтрСравнить(НаименованиеСтатуса, "Просрочено") = 0 Тогда
		Возврат Просрочено;
	Иначе
		Возврат ПустаяСсылка();
	КонецЕсли;
КонецФункции
